Revit 2024 API
Checker.TextureRealWorldScaleX Property
 The property labeled "Size X" from the "Checker" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string TextureRealWorldScaleX { get; }
Visual Basic
Public Shared ReadOnly Property TextureRealWorldScaleX As String
	Get
Visual C++
public:
static property String^ TextureRealWorldScaleX {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDistance" with a minimum of "0.01".
See Also
Checker Class
Autodesk.Revit.DB.Visual Namespace